app/views/comments/_comment.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  <p class="commentator">
    <%= User.find(comment.user_id).username %>