app/views/users/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 3]]
---
    In favorites
    <%= @user.favorites.count %> <%= (@user.favorites.count) == 1 ? 'Post' : 'Posts'%>