app/views/posts/_form.html.erb

      <div class="field">
        <%= form.select :category_id, Category.pluck(:name, :id) %>
---
SELECT "categories"."name", "categories"."id" FROM "categories"