app/views/posts/index.html.erb

SELECT "categories".* FROM "categories"
---
    <div class="category">
      <% Category.all.each do |cat| %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]
---
              <div class="reviews-rating">
                <div class="up-info__rating"><%= post.likes.count %></div>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
                <span>
                  <%= post.comments.count %>