app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "description", "display_in_navbar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "vwevwev"], ["description", "vwevwevwevwewe"], ["display_in_navbar", 0], ["created_at", "2020-12-18 13:09:50.079580"], ["updated_at", "2020-12-18 13:09:50.079580"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "display_in_navbar" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["display_in_navbar", 0], ["updated_at", "2020-12-18 12:55:40.878593"], ["id", 1]]