app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "message", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Jaroslaw"], ["message", "dfn"], ["post_id", 8], ["created_at", "2020-10-22 01:51:07.340833"], ["updated_at", "2020-10-22 01:51:07.340833"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:message).merge(user_id: current_user.id))