app/controllers/favorites_controller.rb

  def create
    if already_favorited?
      flash[:notice] = "You can't add to favorite more than once"
    else
      @post.favorites.create(user_id: current_user.id)
---
INSERT INTO "favorites" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 5], ["created_at", "2020-12-18 17:44:47.373419"], ["updated_at", "2020-12-18 17:44:47.373419"]]

  def destroy
    if !(already_favorited?)
      flash[:notice] = "Cannot unfavorite"
    else
      @favorite.destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]

  def already_favorited?
    Favorite.where(user_id: current_user.id, post_id:
        params[:post_id]).exists?
---
SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."post_id" = ? LIMIT ?  [["user_id", 5], ["post_id", 1], ["LIMIT", 1]]

  def find_favorite
    @favorite = @post.favorites.find(params[:id])
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."id" = ? LIMIT ?  [["post_id", 1], ["id", 1], ["LIMIT", 1]]