app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("author", "title", "content", "timeBypass", "price", "created_at", "updated_at", "country", "city", "interests") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)