app/controllers/subscribers_controller.rb

INSERT INTO "subscribers" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "test@test.ru"], ["created_at", "2020-10-21 19:21:36.381999"], ["updated_at", "2020-10-21 19:21:36.381999"]]
---
  def create
    @subscriber = Subscriber.new(subscriber_params)
    if @subscriber.save